protogia/avr-descriptionfiles-4-nim/svd/ATmega256RFR2.atdf.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYMCNT</name>
      <description>MAC Symbol Counter</description>
      <baseAddress>0x000000D7</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x26</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SCBTSRHH</name>
          <description>Symbol Counter Beacon Timestamp Register HH-Byte</description>
          <addressOffset>0x11</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SCBTSRHH</name>
              <description>Symbol Counter Beacon Timestamp Register HH-Byte</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCBTSRHL</name>
          <description>Symbol Counter Beacon Timestamp Register HL-Byte</description>
          <addressOffset>0x10</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SCBTSRHL</name>
              <description>Symbol Counter Beacon Timestamp Register HL-Byte</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCBTSRLH</name>
          <description>Symbol Counter Beacon Timestamp Register LH-Byte</description>
          <addressOffset>0xF</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SCBTSRLH</name>
              <description>Symbol Counter Beacon Timestamp Register LH-Byte</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCBTSRLL</name>
          <description>Symbol Counter Beacon Timestamp Register LL-Byte</description>
          <addressOffset>0xE</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SCBTSRLL</name>
              <description>Symbol Counter Beacon Timestamp Register LL-Byte</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCCNTHH</name>
          <description>Symbol Counter Register HH-Byte</description>
          <addressOffset>0xD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SCCNTHH</name>
              <description>Symbol Counter Register HH-Byte</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCCNTHL</name>
          <description>Symbol Counter Register HL-Byte</description>
          <addressOffset>0xC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SCCNTHL</name>
              <description>Symbol Counter Register HL-Byte</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCCNTLH</name>
          <description>Symbol Counter Register LH-Byte</description>
          <addressOffset>0xB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SCCNTLH</name>
              <description>Symbol Counter Register LH-Byte</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCCNTLL</name>
          <description>Symbol Counter Register LL-Byte</description>
          <addressOffset>0xA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SCCNTLL</name>
              <description>Symbol Counter Register LL-Byte</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCCR0</name>
          <description>Symbol Counter Control Register 0</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SCCMP</name>
              <description>Symbol Counter Compare Unit 3 Mode select</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SCTSE</name>
              <description>Symbol Counter Automatic Timestamping enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCCKSEL</name>
              <description>Symbol Counter Clock Source select</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCEN</name>
              <description>Symbol Counter enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCMBTS</name>
              <description>Manual Beacon Timestamp</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCRES</name>
              <description>Symbol Counter Synchronization</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCCR1</name>
          <description>Symbol Counter Control Register 1</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SCENBO</name>
              <description>Backoff Slot Counter enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCEECLK</name>
              <description>Enable External Clock Source on PG2</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCCKDIV</name>
              <description>Clock divider for synchronous clock source (16MHz Transceiver Clock)</description>
              <bitRange>[4:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRANSCEIVER_CLOCK_DIVIDED_BY_256_62_5KHZ</name>
                  <description>Transceiver Clock divided by 256, (62.5kHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSCEIVER_CLOCK_DIVIDED_BY_128_125KHZ</name>
                  <description>Transceiver Clock divided by 128, (125kHz)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSCEIVER_CLOCK_DIVIDED_BY_64_250KHZ</name>
                  <description>Transceiver Clock divided by 64,  (250kHz)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSCEIVER_CLOCK_DIVIDED_BY_32_500KHZ</name>
                  <description>Transceiver Clock divided by 32,  (500kHz)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSCEIVER_CLOCK_DIVIDED_BY_16_1MHZ</name>
                  <description>Transceiver Clock divided by 16,  (1MHz)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSCEIVER_CLOCK_DIVIDED_BY_8_2MHZ</name>
                  <description>Transceiver Clock divided by 8,   (2MHz)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSCEIVER_CLOCK_DIVIDED_BY_4_4MHZ</name>
                  <description>Transceiver Clock divided by 4,   (4MHz)</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCBTSM</name>
              <description>Symbol Counter Beacon Timestamp Mask Register</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Res</name>
              <description>Reserved Bit</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCCSR</name>
          <description>Symbol Counter Compare Source Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SCCS1</name>
              <description>Symbol Counter Compare Source select register for Compare Units</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARE_UNIT_1_RELATIVE_COMPARE_SOURCE_BEACON_TIMESTAMP_REGISTER</name>
                  <description>Compare Unit 1 Relative Compare Source = Beacon Timestamp Register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPARE_UNIT_1_RELATIVE_COMPARE_SOURCE_TRANSMIT_FRAME_TIMESTAMP_REGISTER</name>
                  <description>Compare Unit 1 Relative Compare Source = Transmit Frame Timestamp Register</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPARE_UNIT_1_RELATIVE_COMPARE_SOURCE_RECEIVED_FRAME_TIMESTAMP_REGISTER</name>
                  <description>Compare Unit 1 Relative Compare Source = Received Frame Timestamp Register</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCCS2</name>
              <description>Symbol Counter Compare Source select register for Compare Unit 2</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARE_UNIT_2_RELATIVE_COMPARE_SOURCE_BEACON_TIMESTAMP_REGISTER</name>
                  <description>Compare Unit 2 Relative Compare Source = Beacon Timestamp Register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPARE_UNIT_2_RELATIVE_COMPARE_SOURCE_TRANSMIT_FRAME_TIMESTAMP_REGISTER</name>
                  <description>Compare Unit 2 Relative Compare Source = Transmit Frame Timestamp Register</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPARE_UNIT_2_RELATIVE_COMPARE_SOURCE_RECEIVED_FRAME_TIMESTAMP_REGISTER</name>
                  <description>Compare Unit 2 Relative Compare Source = Received Frame Timestamp Register</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCCS3</name>
              <description>Symbol Counter Compare Source select register for Compare Unit 3</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARE_UNIT_3_RELATIVE_COMPARE_SOURCE_BEACON_TIMESTAMP_REGISTER</name>
                  <description>Compare Unit 3 Relative Compare Source = Beacon Timestamp Register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPARE_UNIT_3_RELATIVE_COMPARE_SOURCE_TRANSMIT_FRAME_TIMESTAMP_REGISTER</name>
                  <description>Compare Unit 3 Relative Compare Source = Transmit Frame Timestamp Register</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPARE_UNIT_3_RELATIVE_COMPARE_SOURCE_RECEIVED_FRAME_TIMESTAMP_REGISTER</name>
                  <description>Compare Unit 3 Relative Compare Source = Received Frame Timestamp Register</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Res</name>
              <description>Reserved Bit</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCIRQM</name>
          <description>Symbol Counter Interrupt Mask Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IRQMCP</name>
              <description>Symbol Counter Compare Match 3 IRQ enable</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IRQMOF</name>
              <description>Symbol Counter Overflow IRQ enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IRQMBO</name>
              <description>Backoff Slot Counter IRQ enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Res</name>
              <description>Reserved Bit</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCIRQS</name>
          <description>Symbol Counter Interrupt Status Register</description>
          <addressOffset>0x9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IRQSCP</name>
              <description>Compare Unit 3 Compare Match IRQ</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IRQSOF</name>
              <description>Symbol Counter Overflow IRQ</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IRQSBO</name>
              <description>Backoff Slot Counter IRQ</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Res</name>
              <description>Reserved Bit</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCOCR1HH</name>
          <description>Symbol Counter Output Compare Register 1 HH-Byte</description>
          <addressOffset>0x21</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SCOCR1HH</name>
              <description>Symbol Counter Output Compare Register 1 HH-Byte</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCOCR1HL</name>
          <description>Symbol Counter Output Compare Register 1 HL-Byte</description>
          <addressOffset>0x20</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SCOCR1HL</name>
              <description>Symbol Counter Output Compare Register 1 HL-Byte</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCOCR1LH</name>
          <description>Symbol Counter Output Compare Register 1 LH-Byte</description>
          <addressOffset>0x1F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SCOCR1LH</name>
              <description>Symbol Counter Output Compare Register 1 LH-Byte</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCOCR1LL</name>
          <description>Symbol Counter Output Compare Register 1 LL-Byte</description>
          <addressOffset>0x1E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SCOCR1LL</name>
              <description>Symbol Counter Output Compare Register 1 LL-Byte</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCOCR2HH</name>
          <description>Symbol Counter Output Compare Register 2 HH-Byte</description>
          <addressOffset>0x1D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SCOCR2HH</name>
              <description>Symbol Counter Output Compare Register 2 HH-Byte</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
