protogia/avr-descriptionfiles-4-nim/svd/ATmega256RFR2.atdf.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TC2</name>
      <description>Timer/Counter, 8-bit Async</description>
      <baseAddress>0x00000037</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x39</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x79</offset>
        <size>0x5</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x7F</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ASSR</name>
          <description>Asynchronous Status Register</description>
          <addressOffset>0x7F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TCR2BUB</name>
              <description>Timer/Counter2 Control Register B Update Busy</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TCR2AUB</name>
              <description>Timer/Counter2 Control Register A Update Busy</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCR2BUB</name>
              <description>Timer/Counter2 Output Compare Register B Update Busy</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCR2AUB</name>
              <description>Timer/Counter2 Output Compare Register A Update Busy</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TCN2UB</name>
              <description>Timer/Counter2 Update Busy</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AS2</name>
              <description>Timer/Counter2 Asynchronous Mode</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXCLK</name>
              <description>Enable External Clock Input</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXCLKAMR</name>
              <description>Enable External Clock Input for AMR</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GTCCR</name>
          <description>General Timer Counter Control register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PSRASY</name>
              <description>Prescaler Reset Timer/Counter2</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM</name>
              <description>Timer/Counter Synchronization Mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OCR2A</name>
          <description>Timer/Counter2 Output Compare Register A</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OCR2B</name>
          <description>Timer/Counter2 Output Compare Register B</description>
          <addressOffset>0x7D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TCCR2A</name>
          <description>Timer/Counter2 Control Register A</description>
          <addressOffset>0x79</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WGM2</name>
              <description>Waveform Generation Mode</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_MODE_OF_OPERATION</name>
                  <description>Normal mode of operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_PHASE_CORRECT_TOP_0XFF</name>
                  <description>PWM, phase correct, TOP=0xFF</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTC_TOP_OCRA</name>
                  <description>CTC, TOP = OCRA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAST_PWM_TOP_0XFF</name>
                  <description>Fast PWM, TOP=0xFF</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COM2B</name>
              <description>Compare Match Output B Mode</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_PORT_OPERATION_OC2B_DISCONNECTED</name>
                  <description>Normal port operation, OC2B disconnected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOGGLE_OC2B_ON_COMPARE_MATCH</name>
                  <description>Toggle OC2B on Compare Match</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_OC2B_ON_COMPARE_MATCH</name>
                  <description>Clear OC2B on Compare Match</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_OC2B_ON_COMPARE_MATCH</name>
                  <description>Set OC2B on Compare Match</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COM2A</name>
              <description>Compare Match Output A Mode</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_PORT_OPERATION_OC2A_DISCONNECTED</name>
                  <description>Normal port operation, OC2A disconnected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOGGLE_OC2A_ON_COMPARE_MATCH</name>
                  <description>Toggle OC2A on Compare Match</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_OC2A_ON_COMPARE_MATCH</name>
                  <description>Clear OC2A on Compare Match</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_OC2A_ON_COMPARE_MATCH</name>
                  <description>Set OC2A on Compare Match</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR2B</name>
          <description>Timer/Counter2 Control Register B</description>
          <addressOffset>0x7A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CS2</name>
              <description>Clock Select</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CLOCK_SOURCE_TIMER_COUNTER2_STOPPED</name>
                  <description>No clock source (Timer/Counter2 stopped)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_T2S_1_NO_PRESCALING</name>
                  <description>clk_T2S/1 (no prescaling)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_T2S_8_FROM_PRESCALER</name>
                  <description>clk_T2S/8 (from prescaler)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_T2S_32_FROM_PRESCALER</name>
                  <description>clk_T2S/32 (from prescaler)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_T2S_64_FROM_PRESCALER</name>
                  <description>clk_T2S/64 (from prescaler)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_T2S_128_FROM_PRESCALER</name>
                  <description>clk_T2S/128 (from prescaler)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_T2S_256_FROM_PRESCALER</name>
                  <description>clk_T2S/256 (from prescaler)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_T2S_1024_FROM_PRESCALER</name>
                  <description>clk_T2S/1024 (from prescaler)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WGM22</name>
              <description>Waveform Generation Mode</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FOC2B</name>
              <description>Force Output Compare B</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FOC2A</name>
              <description>Force Output Compare A</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCNT2</name>
          <description>Timer/Counter2</description>
          <addressOffset>0x7B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TIFR2</name>
          <description>Timer/Counter Interrupt Flag Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TOV2</name>
              <description>Timer/Counter2 Overflow Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCF2A</name>
              <description>Output Compare Flag 2 A</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCF2B</name>
              <description>Output Compare Flag 2 B</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Res</name>
              <description>Reserved Bit</description>
              <bitRange>[7:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSK2</name>
          <description>Timer/Counter Interrupt Mask register</description>
          <addressOffset>0x39</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TOIE2</name>
              <description>Timer/Counter2 Overflow Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCIE2A</name>
              <description>Timer/Counter2 Output Compare Match A Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCIE2B</name>
              <description>Timer/Counter2 Output Compare Match B Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Res</name>
              <description>Reserved Bit</description>
              <bitRange>[7:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
