protogia/avr-descriptionfiles-4-nim/svd/ATmega256RFR2.atdf.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TC4</name>
      <description>Timer/Counter, 16-bit</description>
      <baseAddress>0x00000039</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x39</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x67</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x6B</offset>
        <size>0xA</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ICR4</name>
          <description>Timer/Counter4 Input Capture Register  Bytes</description>
          <addressOffset>0x6D</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OCR4A</name>
          <description>Timer/Counter4 Output Compare Register A  Bytes</description>
          <addressOffset>0x6F</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OCR4B</name>
          <description>Timer/Counter4 Output Compare Register B  Bytes</description>
          <addressOffset>0x71</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OCR4C</name>
          <description>Timer/Counter4 Output Compare Register C  Bytes</description>
          <addressOffset>0x73</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TCCR4A</name>
          <description>Timer/Counter4 Control Register A</description>
          <addressOffset>0x67</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WGM4</name>
              <description>Waveform Generation Mode</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_MODE_OF_OPERATION</name>
                  <description>Normal mode of operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_PHASE_CORRECT_8_BIT</name>
                  <description>PWM, phase correct, 8-bit</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_PHASE_CORRECT_9_BIT</name>
                  <description>PWM, phase correct, 9-bit</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_PHASE_CORRECT_10_BIT</name>
                  <description>PWM, phase correct, 10-bit</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COM4C</name>
              <description>Compare Output Mode for Channel C</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_OPERATION</name>
                  <description>Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED</name>
                  <description>Reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COM4B</name>
              <description>Compare Output Mode for Channel B</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_OPERATION</name>
                  <description>Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED</name>
                  <description>Reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COM4A</name>
              <description>Compare Output Mode for Channel A</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_OPERATION</name>
                  <description>Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED</name>
                  <description>Reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR4B</name>
          <description>Timer/Counter4 Control Register B</description>
          <addressOffset>0x68</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CS4</name>
              <description>Clock Select</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CLOCK_SOURCE_TIMER_COUNTER_STOPPED</name>
                  <description>No clock source (Timer/Counter stopped)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_IO_1_NO_PRESCALING</name>
                  <description>clk_IO/1 (no prescaling)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_IO_8_FROM_PRESCALER</name>
                  <description>clk_IO/8 (from prescaler)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_IO_64_FROM_PRESCALER</name>
                  <description>clk_IO/64 (from prescaler)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_IO_256_FROM_PRESCALER</name>
                  <description>clk_IO/256 (from prescaler)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_IO_1024_FROM_PRESCALER</name>
                  <description>clk_IO/1024 (from prescaler)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED</name>
                  <description>Reserved</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WGM4</name>
              <description>Waveform Generation Mode</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_MODE_OF_OPERATION</name>
                  <description>Normal mode of operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_PHASE_CORRECT_8_BIT</name>
                  <description>PWM, phase correct, 8-bit</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_PHASE_CORRECT_9_BIT</name>
                  <description>PWM, phase correct, 9-bit</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_PHASE_CORRECT_10_BIT</name>
                  <description>PWM, phase correct, 10-bit</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Res</name>
              <description>Reserved Bit</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ICES4</name>
              <description>Input Capture 4 Edge Select</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ICNC4</name>
              <description>Input Capture 4 Noise Canceller</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR4C</name>
          <description>Timer/Counter4 Control Register C</description>
          <addressOffset>0x69</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FOC4C</name>
              <description>Force Output Compare for Channel C</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FOC4B</name>
              <description>Force Output Compare for Channel B</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FOC4A</name>
              <description>Force Output Compare for Channel A</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCNT4</name>
          <description>Timer/Counter4  Bytes</description>
          <addressOffset>0x6B</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TIFR4</name>
          <description>Timer/Counter4 Interrupt Flag Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TOV4</name>
              <description>Timer/Counter4 Overflow Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCF4A</name>
              <description>Timer/Counter4 Output Compare A Match Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCF4B</name>
              <description>Timer/Counter4 Output Compare B Match Flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCF4C</name>
              <description>Timer/Counter4 Output Compare C Match Flag</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ICF4</name>
              <description>Timer/Counter4 Input Capture Flag</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSK4</name>
          <description>Timer/Counter4 Interrupt Mask Register</description>
          <addressOffset>0x39</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TOIE4</name>
              <description>Timer/Counter4 Overflow Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCIE4A</name>
              <description>Timer/Counter4 Output Compare A Match Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCIE4B</name>
              <description>Timer/Counter4 Output Compare B Match Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCIE4C</name>
              <description>Timer/Counter4 Output Compare C Match Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ICIE4</name>
              <description>Timer/Counter4 Input Capture Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
