protogia/avr-descriptionfiles-4-nim/svd/ATmega256RFR2.atdf.svd
        <register>
          <name>MAFCR1</name>
          <description>Multiple Address Filter Configuration Register 1</description>
          <addressOffset>0x4F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AACK_0_I_AM_COORD</name>
              <description>Enable PAN Coordinator mode for address filter 0.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AACK_0_SET_PD</name>
              <description>Set Data Pending bit for address filter 0.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AACK_1_I_AM_COORD</name>
              <description>Enable PAN Coordinator mode for address filter 1.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AACK_1_SET_PD</name>
              <description>Set Data Pending bit for address filter 1.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AACK_2_I_AM_COORD</name>
              <description>Enable PAN Coordinator mode for address filter 2.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AACK_2_SET_PD</name>
              <description>Set Data Pending bit for address filter 2.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AACK_3_I_AM_COORD</name>
              <description>Enable PAN Coordinator mode for address filter 3.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AACK_3_SET_PD</name>
              <description>Set Data Pending bit for address filter 3.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAFPA0H</name>
          <description>Transceiver Personal Area Network ID Register for Frame Filter 0 (High Byte)</description>
          <addressOffset>0x53</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAFPA0H</name>
              <description>MAC Personal Area Network ID high Byte for Frame Filter 0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MAFPA0L</name>
          <description>Transceiver Personal Area Network ID Register for Frame Filter 0 (Low Byte)</description>
          <addressOffset>0x52</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAFPA0L</name>
              <description>MAC Personal Area Network ID low Byte for Frame Filter 0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MAFPA1H</name>
          <description>Transceiver Personal Area Network ID Register for Frame Filter 1 (High Byte)</description>
          <addressOffset>0x57</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAFPA1H</name>
              <description>MAC Personal Area Network ID high Byte for Frame Filter 1</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MAFPA1L</name>
          <description>Transceiver Personal Area Network ID Register for Frame Filter 1 (Low Byte)</description>
          <addressOffset>0x56</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAFPA1L</name>
              <description>MAC Personal Area Network ID low Byte for Frame Filter 1</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MAFPA2H</name>
          <description>Transceiver Personal Area Network ID Register for Frame Filter 2 (High Byte)</description>
          <addressOffset>0x5B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAFPA2H</name>
              <description>MAC Personal Area Network ID high Byte for Frame Filter 2</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MAFPA2L</name>
          <description>Transceiver Personal Area Network ID Register for Frame Filter 2 (Low Byte)</description>
          <addressOffset>0x5A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAFPA2L</name>
              <description>MAC Personal Area Network ID low Byte for Frame Filter 2</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MAFPA3H</name>
          <description>Transceiver Personal Area Network ID Register for Frame Filter 3 (High Byte)</description>
          <addressOffset>0x5F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAFPA3H</name>
              <description>MAC Personal Area Network ID high Byte for Frame Filter 3</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MAFPA3L</name>
          <description>Transceiver Personal Area Network ID Register for Frame Filter 3 (Low Byte)</description>
          <addressOffset>0x5E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAFPA3L</name>
              <description>MAC Personal Area Network ID low Byte for Frame Filter 3</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MAFSA0H</name>
          <description>Transceiver MAC Short Address Register for Frame Filter 0 (High Byte)</description>
          <addressOffset>0x51</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAFSA0H</name>
              <description>MAC Short Address high Byte for Frame Filter 0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MAFSA0L</name>
          <description>Transceiver MAC Short Address Register for Frame Filter 0 (Low Byte)</description>
          <addressOffset>0x50</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAFSA0L</name>
              <description>MAC Short Address low Byte for Frame Filter 0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MAFSA1H</name>
          <description>Transceiver MAC Short Address Register for Frame Filter 1 (High Byte)</description>
          <addressOffset>0x55</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAFSA1H</name>
              <description>MAC Short Address high Byte for Frame Filter 1</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MAFSA1L</name>
          <description>Transceiver MAC Short Address Register for Frame Filter 1 (Low Byte)</description>
          <addressOffset>0x54</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAFSA1L</name>
              <description>MAC Short Address low Byte for Frame Filter 1</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MAFSA2H</name>
          <description>Transceiver MAC Short Address Register for Frame Filter 2 (High Byte)</description>
          <addressOffset>0x59</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAFSA2H</name>
              <description>MAC Short Address high Byte for Frame Filter 2</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MAFSA2L</name>
          <description>Transceiver MAC Short Address Register for Frame Filter 2 (Low Byte)</description>
          <addressOffset>0x58</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAFSA2L</name>
              <description>MAC Short Address low Byte for Frame Filter 2</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MAFSA3H</name>
          <description>Transceiver MAC Short Address Register for Frame Filter 3 (High Byte)</description>
          <addressOffset>0x5D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAFSA3H</name>
              <description>MAC Short Address high Byte for Frame Filter 3</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MAFSA3L</name>
          <description>Transceiver MAC Short Address Register for Frame Filter 3 (Low Byte)</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAFSA3L</name>
              <description>MAC Short Address low Byte for Frame Filter 3</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MAN_ID_0</name>
          <description>Device Identification Register (Manufacture ID Low Byte)</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAN_ID_00</name>
              <description>Manufacturer ID (Low Byte)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAN_ID_01</name>
              <description>Manufacturer ID (Low Byte)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAN_ID_02</name>
              <description>Manufacturer ID (Low Byte)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAN_ID_03</name>
              <description>Manufacturer ID (Low Byte)</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAN_ID_04</name>
              <description>Manufacturer ID (Low Byte)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAN_ID_05</name>
              <description>Manufacturer ID (Low Byte)</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAN_ID_06</name>
              <description>Manufacturer ID (Low Byte)</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAN_ID_07</name>
              <description>Manufacturer ID (Low Byte)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAN_ID_1</name>
          <description>Device Identification Register (Manufacture ID High Byte)</description>
          <addressOffset>0xA1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAN_ID_</name>
              <description>Manufacturer ID (High Byte)</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ATMEL_BYTE_1</name>
                  <description>Atmel JEDEC manufacturer ID, bits [15:8] of 32 bit manufacturer ID: 00 00 00 1F</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PAN_ID_0</name>
          <description>Transceiver Personal Area Network ID Register (Low Byte)</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PAN_ID_00</name>
              <description>MAC Personal Area Network ID</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAN_ID_01</name>
              <description>MAC Personal Area Network ID</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAN_ID_02</name>
              <description>MAC Personal Area Network ID</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAN_ID_03</name>
              <description>MAC Personal Area Network ID</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAN_ID_04</name>
              <description>MAC Personal Area Network ID</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAN_ID_05</name>
              <description>MAC Personal Area Network ID</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAN_ID_06</name>
              <description>MAC Personal Area Network ID</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAN_ID_07</name>
              <description>MAC Personal Area Network ID</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAN_ID_1</name>
          <description>Transceiver Personal Area Network ID Register (High Byte)</description>
          <addressOffset>0xA5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PAN_ID_</name>
              <description>MAC Personal Area Network ID</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
